app/controllers/authentication_controller.rb

 def create
  omniauth = request.env["omniauth.auth"]
  #logger.debug "***** The value of results is #{omniauth.inspect}  *******"
  authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
  if authentication
    flash[:notice] = "Signed in successfully."
    #sign_in_and_redirect(:user, authentication.user)
    sign_in(:user, authentication.user)
    redirect_to home_index_url
    #redirect_to me_url
  elsif current_user
    current_user.authentication.create!(:provider => omniauth['provider'], :uid => omniauth['uid'])
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`uid` = '100000630818205' AND `authentications`.`provider` = 'facebook' LIMIT 1
INSERT INTO `authentications` (`user_id`, `updated_at`, `provider`, `client_id`, `created_at`, `uid`, `token`) VALUES (2, '2012-02-09 16:37:40', 'facebook', NULL, '2012-02-09 16:37:40', '100000630818205', 'AAAE3hAyMYokBAP31B9b609ygiZAHMB3FXJ1QiW1G06QGwAcavF77O1wXVP6hI3KemFFb9RPkdl2RBCtzqRm3TSURmvBkZASM8y3x9iYAZDZD')
INSERT INTO `users` (`reset_password_token`, `current_sign_in_ip`, `sign_in_count`, `last_sign_in_at`, `remember_created_at`, `client_id`, `updated_at`, `encrypted_password`, `reset_password_sent_at`, `current_sign_in_at`, `last_sign_in_ip`, `email`, `created_at`) VALUES (NULL, NULL, 0, NULL, NULL, NULL, '2012-02-09 20:08:46', '', NULL, NULL, NULL, '', '2012-02-09 20:08:46')